
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 3 to change, 2 to destroy.</code></pre>

* Update
  * module.feepay-fail-action-group.azurerm_resource_group_template_deployment.action-group
  * module.feepay-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.topic-premium.azurerm_servicebus_topic.servicebus_topic
* Replace
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.subscription-premium.azurerm_servicebus_subscription.servicebus_subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] must be replaced
-/+ resource "azurerm_monitor_activity_log_alert" "main" {
      ~ id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - ccpay-aat" -> (known after apply)
      ~ name                = "Application Insights daily cap reached - ccpay-aat" -> "Application-Insights-daily-cap-reached-ccpay-aat" # forces replacement
        tags                = {
            "Deployment Environment" = "aat"
            "Team Contact"           = "#fee-pay-nightly-pipeline"
            "Team Name"              = "cc-payments"
            "application"            = "fees-and-payments"
            "autoShutdown"           = "true"
            "builtFrom"              = "https://github.com/HMCTS/ccpayfr-shared-infrastructure.git"
            "businessArea"           = "CFT"
            "contactSlackChannel"    = "#cc-payments"
            "environment"            = "staging"
            "managedBy"              = "Fees/Pay"
        }
        # (5 unchanged attributes hidden)

      ~ criteria {
          - levels                  = [] -> null
          - resource_groups         = [] -> null
          - resource_ids            = [] -> null
          - resource_providers      = [] -> null
          - resource_types          = [] -> null
          - statuses                = [] -> null
          - sub_statuses            = [] -> null
            # (13 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.feepay-fail-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.Resources/deployments/feepay-alert"
        name                     = "feepay-alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.feepay-fail-alert.data.template_file.metricalerttemplate will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "metricalerttemplate" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName          = {
                      + type = "string"
                    }
                  + actionGroupRg            = {
                      + type = "string"
                    }
                  + alertDesc                = {
                      + type = "string"
                    }
                  + alertName                = {
                      + type = "string"
                    }
                  + appInsightsName          = {
                      + type = "string"
                    }
                  + appInsightsQuery         = {
                      + type = "string"
                    }
                  + commonTags               = {
                      + type = "string"
                    }
                  + customEmailSubject       = {
                      + type = "string"
                    }
                  + frequencyInMinutes       = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + location                 = {
                      + type = "string"
                    }
                  + severityLevel            = {
                      + defaultValue = "3"
                      + type         = "string"
                    }
                  + timeWindowInMinutes      = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + triggerThreshold         = {
                      + type = "string"
                    }
                  + triggerThresholdOperator = {
                      + allowedValues = [
                          + "GreaterThan",
                          + "Equal",
                          + "LessThan",
                        ]
                      + defaultValue  = "GreaterThan"
                      + type          = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-09-01-preview"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('alertName')]"
                      + properties = {
                          + action      = {
                              + aznsAction   = {
                                  + actionGroup  = [
                                      + "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  + emailSubject = "[parameters('customEmailSubject')]"
                                }
                              + "odata.type" = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              + severity     = "[parameters('severityLevel')]"
                              + status       = "Active"
                              + trigger      = {
                                  + consecutiveBreach = 1
                                  + threshold         = "[parameters('triggerThreshold')]"
                                  + thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          + description = "[parameters('alertDesc')]"
                          + enabled     = "true"
                          + schedule    = {
                              + frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              + timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          + skuType     = "L1"
                          + source      = {
                              + dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              + query        = "[parameters('appInsightsQuery')]"
                              + queryType    = "ResultCount"
                            }
                        }
                      + tags       = "[union(variables('tags'), variables('additionalTags'))]"
                      + type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              + variables      = {
                  + additionalTags = {
                      + "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  + tags           = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.feepay-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.Resources/deployments/feepay-fail-alert"
        name                     = "feepay-fail-alert"
      ~ output_content           = jsonencode({}) -> (known after apply)
        tags                     = {}
      ~ template_content         = jsonencode(
            {
              - "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupName          = {
                      - type = "String"
                    }
                  - actionGroupRg            = {
                      - type = "String"
                    }
                  - alertDesc                = {
                      - type = "String"
                    }
                  - alertName                = {
                      - type = "String"
                    }
                  - appInsightsName          = {
                      - type = "String"
                    }
                  - appInsightsQuery         = {
                      - type = "String"
                    }
                  - commonTags               = {
                      - type = "String"
                    }
                  - customEmailSubject       = {
                      - type = "String"
                    }
                  - frequencyInMinutes       = {
                      - defaultValue = "5"
                      - type         = "String"
                    }
                  - location                 = {
                      - type = "String"
                    }
                  - severityLevel            = {
                      - defaultValue = "3"
                      - type         = "String"
                    }
                  - timeWindowInMinutes      = {
                      - defaultValue = "5"
                      - type         = "String"
                    }
                  - triggerThreshold         = {
                      - type = "String"
                    }
                  - triggerThresholdOperator = {
                      - allowedValues = [
                          - "GreaterThan",
                          - "Equal",
                          - "LessThan",
                        ]
                      - defaultValue  = "GreaterThan"
                      - type          = "String"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-09-01-preview"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('alertName')]"
                      - properties = {
                          - action      = {
                              - aznsAction   = {
                                  - actionGroup  = [
                                      - "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  - emailSubject = "[parameters('customEmailSubject')]"
                                }
                              - "odata.type" = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              - severity     = "[parameters('severityLevel')]"
                              - status       = "Active"
                              - trigger      = {
                                  - consecutiveBreach = 1
                                  - threshold         = "[parameters('triggerThreshold')]"
                                  - thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          - description = "[parameters('alertDesc')]"
                          - enabled     = "true"
                          - schedule    = {
                              - frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              - timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          - skuType     = "L1"
                          - source      = {
                              - dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              - query        = "[parameters('appInsightsQuery')]"
                              - queryType    = "ResultCount"
                            }
                        }
                      - tags       = "[union(variables('tags'), variables('additionalTags'))]"
                      - type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              - variables      = {
                  - additionalTags = {
                      - "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  - tags           = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.subscription-premium.data.azurerm_servicebus_topic.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
  # (moved from module.subscription-premium.data.azurerm_servicebus_topic.this)
 <= data "azurerm_servicebus_topic" "this" {
      + auto_delete_on_idle                     = (known after apply)
      + batched_operations_enabled              = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + express_enabled                         = (known after apply)
      + id                                      = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "ccpay-service-callback-topic"
      + namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.ServiceBus/namespaces/ccpay-servicebus-aat-premium"
      + partitioning_enabled                    = (known after apply)
      + requires_duplicate_detection            = (known after apply)
      + status                                  = (known after apply)
      + support_ordering                        = (known after apply)
    }

  # module.subscription-premium.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ auto_delete_on_idle                       = "P10675199DT2H48M5.477S" -> "P10675199DT2H48M5.4775807S"
      ~ batched_operations_enabled                = true -> false
      ~ default_message_ttl                       = "P10675199DT2H48M5.477S" -> "P10675199DT2H48M5.4775807S"
      ~ id                                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.ServiceBus/namespaces/ccpay-servicebus-aat-premium/topics/ccpay-service-callback-topic/subscriptions/serviceCallbackPremiumSubscription" -> (known after apply)
        name                                      = "serviceCallbackPremiumSubscription"
      ~ topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.ServiceBus/namespaces/ccpay-servicebus-aat-premium/topics/ccpay-service-callback-topic" # forces replacement -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.topic-premium.azurerm_servicebus_topic.servicebus_topic will be updated in-place
  ~ resource "azurerm_servicebus_topic" "servicebus_topic" {
      ~ auto_delete_on_idle                     = "P10675199DT2H48M5.477S" -> "P10675199DT2H48M5.4775807S"
      ~ batched_operations_enabled              = true -> false
      ~ default_message_ttl                     = "P10675199DT2H48M5.477S" -> "P10675199DT2H48M5.4775807S"
        id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.ServiceBus/namespaces/ccpay-servicebus-aat-premium/topics/ccpay-service-callback-topic"
        name                                    = "ccpay-service-callback-topic"
        # (9 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":101,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->